{
  "Disciplinas": [
    {
    "Nome (ptBR)": "Programação Orientada a Objetos",
    "Nome (enUS)": "Object Oriented Programming",
    "Código": "BCC138",
    "Departamento": "Departamento de Computação (DECOM)",
    "Unidade Acadêmica": "ICEB",
    "Modalidade": "presencial",
    "Carga Horária": {
      "Total": "60",
      "Extensionista": "0",
      "Teórica": "4",
      "Prática": "0"
    },
    "Ementa": "Conceitos básicos de orientação a objetos, Classe, Objeto, Mensagem, Encapsulamento, Herança, Polimorfismo, Ligação dinâmica, Tratamento de exceções, Genéricos, Coleções, Modelagem UML, Interface gráfica em ambientes orientados a objetos. Objetos persistentes.",
    "Conteúdo Programático": [
      "Visão geral do paradigma de programação orientada a objetos",
      "Modelagem UML",
      "Classes, objetos, mensagens",
      "Herança",
      "Polimorfismo",
      "Ligação dinâmica",
      "Tratamento de exceções",
      "Genéricos",
      "Coleções",
      "Objetos persistentes",
      "Interfaces gráficas",
      "Programação em C++ e Java"
    ],
    "Bibliografia Básica": [
      "DEITEL, Harvey M.; DEITEL, P. J. C++ como programar. 5. ed. São Paulo: Pearson Prentice Hall, 2006.",
      "DEITEL, Paul; DEITEL, Paul J. Java: como programar. 8. ed. São Paulo: Prentice-Hall, 2010.",
      "FOWLER, Martin. UML Essencial. Um breve guia para a linguagem-padrão de modelagem de objetos. 3. ed. Bookman, 2005.",
      "MEYER, Bertrand. Object-oriented software construction. 2nd. ed. Upper Saddle River, NJ: Prentice-Hall PTR, 1997.",
      "BOOCH, Grady. Object-oriented analysis and design with applications. 3rd. ed. New Delhi: Pearson, 2009."
    ],
    "Bibliografia Complementar": [
      "LEE, Richard C.; TEPFENHART, William M. UML e C++: guia prático de desenvolvimento orientado a objeto. Pearson, 2001.",
      "PAGE-JONES, Meilir. Fundamentos do desenho orientado a objeto com UML. São Paulo: Makron Books, 2001.",
      "ORGANIZADOR, Rafael Felix. Programação orientada a objetos. Pearson, 2017.",
      "SINTES, Anthony. Aprenda Programação orientada a objetos em 21 dias. 5. ed. Pearson, 2014.",
      "SANTOS, Rafael. Introdução à programação orientada a objetos usando JAVA. 9. ed. Rio de Janeiro: Elsevier, 2003.",
      "BARNES, David J.; KÖLLING, Michael. Programação orientada a objetos com Java: uma introdução prática usando o BlueJ. 4. ed. São Paulo: Prentice-Hall, 2009.",
      "LARMAN, Craig. Utilizando UML e padrões: uma introdução à análise e ao projeto orientados a objetos. 2. ed. Porto Alegre: Bookman, 2004."
    ]
  },

    {
    "Nome (ptBR)": "Estrutura de Dados I",
    "Nome (enUS)": "Data Structures I",
    "Código": "BCC137",
    "Departamento": "Departamento de Computação (DECOM)",
    "Unidade Acadêmica": "ICEB",
    "Modalidade": "presencial",
    "Carga Horária": {
      "Total": "90",
      "Extensionista": "0",
      "Teórica": "4",
      "Prática": "2"
    },
    "Ementa": "Recursividade; conceitos básicos de análise assintótica de algoritmos; tipos abstratos de dados; estruturas de dados: listas, pilhas, filas de prioridade e árvores binárias; algoritmos de ordenação por comparação de chaves (seleção, inserção, bolha, shellsort, quicksort, mergesort, heapsort); algoritmos de ordenação em tempo linear (counting sort, radix sort e bucket sort); algoritmos de pesquisa (simples, binária, árvores binárias de busca, hashing, conjuntos e mapas).",
    "Conteúdo Programático": [
      "Revisão de alocação dinâmica de memória",
      "Recursividade",
      "Noções de análise de complexidade de algoritmos",
      "Conceitos",
      "Medidas de avaliação: tempo e espaço",
      "Análise assintótica: notação O, Omega e Theta",
      "Hierarquia de funções e classes de problemas",
      "Tipos de dados abstratos",
      "Estruturas de dados",
      "Listas",
      "Pilhas",
      "Filas",
      "Filas de prioridade",
      "Árvores",
      "Conjuntos",
      "Mapas",
      "Algoritmos",
      "Ordenação por comparação: Selection Sort, Insertion Sort, Bubblesort, Shellsort, Quicksort, Heapsort e Mergesort",
      "Ordenação em tempo linear: Counting Sort, Radix Sort e Bucket Sort",
      "Pesquisa: Simples, Binária, Árvores Binárias, AVL e Hashing"
    ],
    "Bibliografia Básica": [
      "ZIVIANI, N. Projeto de algoritmos: com implementações em Pascal e C. 3. ed. rev. e ampl. São Paulo: Cengage Learning, 2011.",
      "CELES, W.; CERQUEIRA, R.; RANGEL, J. L. Introdução a Estruturas de Dados: com técnicas de programação em C. Rio de Janeiro: Elsevier, 2004.",
      "CORMEN, T. H.; LEISERSON, C. E.; RIVEST, R. L.; STEIN, C. Algoritmos: teoria e prática. Rio de Janeiro: Campus, 2002."
    ],
    "Bibliografia Complementar": [
      "KLEINBERG, J.; TARDOS, E. Algorithm Design. Boston: Addison-Wesley, 2006.",
      "KNUTH, D. E. The Art of Computer Programming. Upper Saddle River: Addison-Wesley, 2005.",
      "GOODRICH, M. T.; TAMASSIA, R.; COPSTEIN, B. Projeto de algoritmos: fundamentos, análise e exemplos da Internet. Porto Alegre: Bookman, 2004.",
      "DROZDEK, A. Estrutura de Dados e Algoritmos em C++. São Paulo: Cengage Learning, 2002.",
      "TENENBAUM, A. M.; LANGSAM, Y.; AUGENSTEIN, M. Estruturas de Dados usando C. São Paulo: Makron Books, 1995."
    ]
  },
   {
    "Nome (ptBR)": "Cálculo Diferencial e Integral I",
    "Nome (enUS)": "Differential and Integral Calculus I",
    "Código": "MTM122",
    "Departamento": "Departamento de Matemática (DEMAT)",
    "Unidade Acadêmica": "Instituto de Ciências Exatas e Biológicas (ICEB)",
    "Modalidade": "presencial",
    "Carga Horária": {
      "Total": "90",
      "Extensionista": "0",
      "Teórica": "6",
      "Prática": "0"
    },
    "Ementa": "Números reais; funções; limites; continuidade; derivada e aplicações; a integral.",
    "Conteúdo Programático": [
      "Números Reais: conjuntos numéricos; propriedades e operações; inequações; valor absoluto.",
      "Funções e Gráficos: função de primeiro grau; de segundo grau; funções trigonométricas, exponencial, hiperbólicas, compostas e inversas.",
      "Limite, Continuidade e Derivada: definição de limite, continuidade; limites laterais, no infinito e infinitos; propriedades e limites fundamentais; funções deriváveis; retas tangentes e normais; diferencial.",
      "Funções e suas Derivadas: regras de derivação; derivada das funções trigonométricas, exponencial, inversa, trigonométricas inversas e logarítmica.",
      "Aplicações da Derivada: máximos e mínimos; Teorema do Valor Médio; regra de L’Hospital; crescimento e concavidade; gráficos de funções; problemas de otimização; taxa de variação.",
      "A Integral: integral indefinida e suas propriedades; integral definida; área de regiões planas; Teorema Fundamental do Cálculo.",
      "Técnicas de Integração: substituição; partes; frações parciais; potências e produtos de funções trigonométricas; substituições inversas."
    ],
    "Bibliografia Básica": [
      "FLEMMING, Diva Marília; GONÇALVES, Mirian Buss. Cálculo A: funções, limite, derivação, integração. 5. ed. rev. e amp. São Paulo/Florianópolis: Makron Books/Editora da UFSC, 1992.",
      "LEITHOLD, Louis. O Cálculo com Geometria Analítica. 3. ed. São Paulo: Harbra, 1994.",
      "STEWART, James. Cálculo – Volume I. 6. ed. São Paulo: Cengage Learning, 2010."
    ],
    "Bibliografia Complementar": [
      "ANTON, Howard. Cálculo: um novo horizonte – Vol. 1. 6. ed. Porto Alegre: Bookman, 2000.",
      "GUIDORIZZI, Hamilton Luiz. Um Curso de Cálculo – Vol. 1. 5. ed. São Paulo: LTC, 2001.",
      "MUNEM, Mustafa A.; FOULIS, David J. Cálculo – Volume 1. Rio de Janeiro: Guanabara Koogan, 1982.",
      "SIMMONS, George Finlay. Cálculo com Geometria Analítica – Volume 1. São Paulo: Makron Books, 1987.",
      "THOMAS, George B.; HASS, Joel; WEIR, Maurice D. Cálculo – Volume 1. 12. ed. São Paulo: Pearson Education do Brasil, 2013."
    ]
  },
    {
      "Nome (ptBR)": "Matemática Discreta I",
      "Nome (enUS)": "Discrete Mathematics I",
      "Código": "BCC101",
      "Departamento": "Departamento de Computação (DECOM)",
      "Unidade Acadêmica": "ICEB",
      "Modalidade": "presencial",
      "Carga Horária": {
        "Total": "60",
        "Extensionista": "0",
        "Teórica": "4",
        "Prática": "0"
      },
      "Ementa": "Introdução à teoria de conjuntos: definições de conjuntos, operações sobre conjuntos, cardinalidade de conjuntos. Funções: conceitos básicos, composição, funções recursivas. Lógica proposicional e lógica de predicados: sintaxe, semântica e sistema de dedução. Estratégias de prova. Indução e recursão.",
      "Conteúdo Programático": [
        "Introdução e Revisão de Teoria de Conjuntos",
        "Sintaxe e Semântica da Lógica Proposicional",
        "Sistema de Dedução da Lógica Proposicional",
        "Álgebra Booleana",
        "Sintaxe e Semântica da Lógica de Predicados",
        "Sistema de DeduçãoLógica de Predicados",
        "Álgebra de Predicados",
        "Estratégias de prova",
        "Indução e Recursão",
        "Provas e correção de provas"
      ],
      "Bibliografia Básica": [
        "VELLEMAN, Daniel J. How to Prove It: A Structured Approach. Cambridge: Cambridge University Press, 2006.",
        "ROSEN, Kenneth H. Matemática Discreta e suas Aplicações. 6. ed. São Paulo: McGraw-Hill, 2009.",
        "O´DONNELL, John; HALL, Cordelia; PAGE, Rex. Discrete Mathematics Using a Computer. Glasgow: Springer-Verlag, 2000."
      ],
      "Bibliografia Complementar": [
        "HUTH, Michael; RYAN, Mark. Lógica em Ciência da Computação: Modelagem e Argumentação sobre Sistemas. 2. ed. Rio de Janeiro: LTC, 2008.",
        "SCHEINERMAN, Edward R. Matemática Discreta: Uma Introdução. São Paulo: Cengage Learning, 2011.",
        "GERSTING, Judith L. Fundamentos Matemáticos para a Ciência da Computação. 5. ed. Rio de Janeiro: LTC, 2004."
      ]
    },
    {
      "Nome (ptBR)": "Introdução à Programação",
      "Nome (enUS)": "Introduction to Programming",
      "Código": "BCC201",
      "Departamento": "Departamento de ComputaçãoDECOM",
      "Unidade Acadêmica": "ICEB",
      "Modalidade": "presencial",
      "Carga Horária": {
        "Total": "90",
        "Extensionista": "0",
        "Teórica": "4",
        "Prática": "2"
      },
      "Ementa": "Introdução à lógica de programação; conceitos básicos sobre algoritmos, utilização e formas de representação (fluxograma e portugol); tipos de dados; variáveis e constantes; expressões e operadores relacionais, aritméticos e lógicos; estruturas condicionais e de repetição; sub-programação: modularização de programas (funções e procedimentos); estruturas de dados homogêneas (vetores e matrizes) e heterogêneas (estruturas/registro); manipulação de cadeias de caracteres; ponteiros; alocação dinâmica de memória; processamento de arquivos.",
      "Conteúdo Programático": [
        "Representação de dados",
        "Conceitos e Representação de algoritmos",
        "Fluxograma e portugol",
        "Conceitos básicos de programação, valores, tipos e expressões",
        "Variáveis, comandos de atribuição e de entrada e saída",
        "Comandos de controle de fluxo",
        "Comando de decisão (if)",
        "Comandos de decisão múltipla, de salto (switch, break)",
        "Comando de repetição (while, do-while, for)",
        "Sub-programação: Funções; procedimentos e parâmetros",
        "Estruturas de dados homogêneas (vetores)",
        "Cadeia de caracteres (strings)",
        "Estruturas de dados homogêneas (Matrizes)",
        "Estrutura heterogêneas",
        "Apontadores e memória dinâmica (Ponteiros)",
        "Arquivos"
      ],
      "Bibliografia Básica": [
        "DEITEL, P.; DEITEL, H. M. C: como programar. 6. ed. São Paulo: Pearson Education, 2011.",
        "DEITEL, H. M.; DEITEL, P. J. C++: como programar. 5. ed. São Paulo: Pearson Prentice Hall, 2006.",
        "SOUZA, M. A. F. de. Algoritmos e lógica de programação. São Paulo: Cengage Learning, 2005."
      ],
      "Bibliografia Complementar": [
        "ASCENCIO, A. F. G.; CAMPOS, E. A. V. Fundamentos da programação de computadores: algoritmos, pascal e c/c++. 2. ed. São Paulo: Prentice-Hall, 2007.",
        "GUEDES, S. Lógica de Programação Algorítmica. São Paulo: Pearson Education do Brasil, 2014.",
        "MIZRAHI, V. V. Treinamento em linguagem C. 2. ed. São Paulo: Pearson Education, 2010.",
        "MIZRAHI, V. V. Treinamento em linguagem C++: módulo 2. São Paulo: Pearson Education, 2006.",
        "SAVITCH, W. J. C++ absoluto. São Paulo: Pearson Education: Addison Wesley, 2004."
      ]
    },
    {
      "Nome (ptBR)": "Introdução à Inteligência Artificial",
      "Nome (enUS)": "Introduction to Artificial Intelligence",
      "Código": "BIA003",
      "Departamento": "Departamento de Computação (DECOM)",
      "Unidade Acadêmica": "ICEB",
      "Modalidade": "presencial",
      "Carga Horária": {
        "Total": "60",
        "Extensionista": "0",
        "Teórica": "4",
        "Prática": "0"
      },
      "Ementa": "O que é Inteligência Artificial; o comportamento do aluno de Inteligência Artificial; áreas de pesquisa do Departamento de Computação; áreas nas quais atuam os profissionais em Inteligência Artificial.",
      "Conteúdo Programático": [
        "A área de Inteligência Artificial e suas oportunidades atuais.",
        "Áreas de atuação e mercado de trabalho em Inteligência Artificial.",
        "O curso de Inteligência Artificial: grade curricular, áreas, relações entre as disciplinas.",
        "Organização política da universidade e institutos/unidades.",
        "Representação acadêmica: centro acadêmico e movimentos estudantis.",
        "Seminários sobre as áreas de pesquisa e extensão dos professores do DECOM.",
        "Apresentação das atividades dos laboratórios de pesquisa e extensão.",
        "O comportamento do aluno de Inteligência Artificial: organização e conselhos para estudar melhor e ter sucesso no curso.",
        "Seminários de profissionais sobre o mercado de trabalho e carreiras na área de Inteligência Artificial."
      ],
      "Bibliografia Básica": [
        "MORAIS, Regis de (org.). Filosofia da ciência e da tecnologia: introdução metodológica e crítica. 1. ed. Campinas: Papirus, 2013. E-book. Disponível em: https://plataforma.bvirtual.com.br. Acesso em: jun/2025.",
        "MEDEIROS, Luciano Frontino de. Inteligência artificial aplicada: uma abordagem introdutória. Curitiba, PR: Intersaberes, 2018. E-book. Disponível em: https://plataforma.bvirtual.com.br. Acesso em: jun/2025.",
        "DIAS, Ana Francisca Pinto et al.; GUIMARÃES, João Alexandre Silva Alves; ALVES, Rodrigo Vitorino Souza (org.). Os direitos humanos e a ética na era da inteligência artificial. Indaiatuba, SP: Foco, 2023. E-book. Disponível em: https://plataforma.bvirtual.com.br. Acesso em: jun/2025."
      ],
      "Bibliografia Complementar": [
        "KRELLING NETO, Antonio Osmar. Responsabilidade civil: cibercrimes. 1. ed. São Paulo: Contentus, 2020. E-book. Disponível em: https://plataforma.bvirtual.com.br. Acesso em: jun/2025.",
        "TAURION, Cezar. Big data. 1. ed. Rio de Janeiro: Brasport, 2013. E-book. Disponível em: https://plataforma.bvirtual.com.br. Acesso em: jun/2025.",
        "MUNHOZ, Antonio Siemsen. Responsabilidade e autoridade social das empresas. 1. ed. Curitiba: Intersaberes, 2015. E-book. Disponível em: https://plataforma.bvirtual.com.br. Acesso em: jun/2025.",
        "FLORES, Márcio José das; BESS, Alexandre Leal. Inteligência artificial aplicada a negócios. Curitiba, PR: Intersaberes, 2023. E-book. Disponível em: https://plataforma.bvirtual.com.br. Acesso em: jun/2025.",
        "MUNIZ, Antonio et al. Inteligência artificial: entenda como a IA pode impactar no mercado de trabalho e na sociedade. [S.l.]: Brasport, 2024. E-book. Disponível em: https://plataforma.bvirtual.com.br. Acesso em: jun/2025."
      ]
    },
    {
      "Nome (ptBR)": "Introdução à Programação",
      "Nome (enUS)": "Introduction to Programming",
      "Código": "BCC201",
      "Departamento": "Departamento de ComputaçãoDECOM",
      "Unidade Acadêmica": "ICEB",
      "Modalidade": "presencial",
      "Carga Horária": {
        "Total": "90",
        "Extensionista": "0",
        "Teórica": "4",
        "Prática": "2"
      },
      "Ementa": "Introdução à lógica de programação; conceitos básicos sobre algoritmos, utilização e formas de representação (fluxograma e portugol); tipos de dados; variáveis e constantes; expressões e operadores relacionais, aritméticos e lógicos; estruturas condicionais e de repetição; sub-programação: modularização de programas (funções e procedimentos); estruturas de dados homogêneas (vetores e matrizes) e heterogêneas (estruturas/registro); manipulação de cadeias de caracteres; ponteiros; alocação dinâmica de memória; processamento de arquivos.",
      "Conteúdo Programático": [
        "Representação de dados",
        "Conceitos e Representação de algoritmos",
        "Fluxograma e portugol",
        "Conceitos básicos de programação, valores, tipos e expressões",
        "Variáveis, comandos de atribuição e de entrada e saída",
        "Comandos de controle de fluxo",
        "Comando de decisão (if)",
        "Comandos de decisão múltipla, de salto (switch, break)",
        "Comando de repetição (while, do-while, for)",
        "Sub-programação: Funções; procedimentos e parâmetros",
        "Estruturas de dados homogêneas (vetores)",
        "Cadeia de caracteres (strings)",
        "Estruturas de dados homogêneas (Matrizes)",
        "Estrutura heterogêneas",
        "Apontadores e memória dinâmica (Ponteiros)",
        "Arquivos"
      ],
      "Bibliografia Básica": [
        "DEITEL, P.; DEITEL, H. M. C: como programar. 6. ed. São Paulo: Pearson Education, 2011.",
        "DEITEL, H. M.; DEITEL, P. J. C++: como programar. 5. ed. São Paulo: Pearson Prentice Hall, 2006.",
        "SOUZA, M. A. F. de. Algoritmos e lógica de programação. São Paulo: Cengage Learning, 2005."
      ],
      "Bibliografia Complementar": [
        "ASCENCIO, A. F. G.; CAMPOS, E. A. V. Fundamentos da programação de computadores: algoritmos, pascal e c/c++. 2. ed. São Paulo: Prentice-Hall, 2007.",
        "GUEDES, S. Lógica de Programação Algorítmica. São Paulo: Pearson Education do Brasil, 2014.",
        "MIZRAHI, V. V. Treinamento em linguagem C. 2. ed. São Paulo: Pearson Education, 2010.",
        "MIZRAHI, V. V. Treinamento em linguagem C++: módulo 2. São Paulo: Pearson Education, 2006.",
        "SAVITCH, W. J. C++ absoluto. São Paulo: Pearson Education: Addison Wesley, 2004."
      ]
    }

  ]
}
